Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks.module.kms.aws_kms_key.this[0] has changed
~ resource "aws_kms_key" "this" {
        id                                 = "2bad14fa-6188-40bc-a39c-7ce04cff5c42"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::895976263444:role/poc-eks-cluster-cluster-20250615224556704300000003"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:ListAliases",
                          + "kms:GetKeyPolicy",
                          + "kms:GetKeyRotationStatus",
                          + "kms:ListResourceTags",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::895976263444:role/atlantis-irsa-role"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowAtlantisIRSAKeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment" = "production"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
- destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.helm.helm_release.atlantis will be updated in-place
~ resource "helm_release" "atlantis" {
        id                         = "atlantis-new"
      ~ metadata                   = [
          - {
              - app_version    = "v0.34.0"
              - chart          = "atlantis"
              - first_deployed = 1750038229
              - last_deployed  = 1750038362
              - name           = "atlantis-new"
              - namespace      = "default"
              - notes          = <<-EOT
                    1. Get the application URL by running these commands:
                    2. Atlantis will not start successfully unless at least one of the following sets of credentials are specified (see values.yaml for detailed usage):
                      - github
                      - githubApp
                      - gitea
                      - gitlab
                      - bitbucket
                EOT
              - revision       = 2
              - values         = jsonencode(
                    {
                      - atlantisUrl    = "http://a6a50b2a1c777415fa9887f3c985f539-1548251577.eu-central-1.elb.amazonaws.com"
                      - github         = {
                          - secret = "d9f7a3b1e8c54f72a6d8e9b3c1f0a7d4e5b6c7d8"
                          - token  = "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"
                          - user   = "shwetaec12"
                        }
                      - orgAllowlist   = "github.com/shwetaec12/eks-atlantis-poc"
                      - repoConfig     = <<-EOT
                            repos:
                              - id: github.com/shwetaec12/eks-atlantis-poc
                        EOT
                      - service        = {
                          - type = "LoadBalancer"
                        }
                      - serviceAccount = {
                          - create = false
                          - name   = "atlantis-new"
                        }
                      - volumeClaim    = {
                          - storageClassName = "gp3-immediate"
                        }
                    }
                )
              - version        = "5.17.2"
            },
        ] -> (known after apply)
        name                       = "atlantis-new"
      ~ values                     = [
          ~ <<-EOT
              - orgAllowlist: "github.com/shwetaec12/eks-atlantis-poc"
              + orgAllowlist: "github.com/shwetaec12/eks-atlantis-poc"
              - github:
              + github:
              -   user: "shwetaec12"
              +   user: "shwetaec12"
              -   token: "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" 
              +   token: "" 
              -   secret: "d9f7a3b1e8c54f72a6d8e9b3c1f0a7d4e5b6c7d8"
              +   secret: "d9f7a3b1e8c54f72a6d8e9b3c1f0a7d4e5b6c7d8"
              - 
              + 
              - repoConfig: |-
              + repoConfig: |-
              -   repos:
              +   repos:
              -     - id: github.com/shwetaec12/eks-atlantis-poc
              +     - id: github.com/shwetaec12/eks-atlantis-poc
              -       
              +       
              - atlantisUrl: "http://a6a50b2a1c777415fa9887f3c985f539-1548251577.eu-central-1.elb.amazonaws.com"
              + atlantisUrl: "http://aa0a94120fa8844e187fcfb39f84328e-259313376.eu-central-1.elb.amazonaws.com"
              - 
              + 
              - volumeClaim:
              + volumeClaim:
              -   storageClassName: "gp3-immediate"
              +   storageClassName: "gp3-immediate"
              - 
              + 
              - service:
              + service:
              -   type: "LoadBalancer"
              +   type: "LoadBalancer"
              - 
              + 
              - # Use existing service account with IRSA role attached
              + # Use existing service account with IRSA role attached
              - serviceAccount:
              + serviceAccount:
              -   create: false
              +   create: false
                  name: "atlantis-new"
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.iam.data.aws_iam_policy_document.atlantis_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "atlantis_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:default:atlantis-new",
                ]
              + variable = "oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam.data.aws_iam_policy_document.eks_admin_assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_admin_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam.aws_iam_openid_connect_provider.oidc must be replaced
+/- resource "aws_iam_openid_connect_provider" "oidc" {
      ~ arn             = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0" -> (known after apply)
      ~ id              = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0" -> (known after apply)
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
      ~ url             = "oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0" -> "https://oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role.atlantis_irsa_role will be updated in-place
~ resource "aws_iam_role" "atlantis_irsa_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0:sub" = "system:serviceaccount:default:atlantis-new"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "atlantis-irsa-role"
        name                  = "atlantis-irsa-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.iam.aws_iam_role.eks_admin will be updated in-place
~ resource "aws_iam_role" "eks_admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-admin"
        name                  = "eks-admin"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role.node_group will be updated in-place
~ resource "aws_iam_role" "node_group" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-node-group"
        name                  = "eks-node-group"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.iam.kubernetes_cluster_role.atlantis_rbac will be destroyed
  # (because kubernetes_cluster_role.atlantis_rbac is not in configuration)
- resource "kubernetes_cluster_role" "atlantis_rbac" {
      - id = "atlantis-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "atlantis-access" -> null
          - resource_version = "49381" -> null
          - uid              = "f9ca50b7-d914-4331-afd1-18a0730624e0" -> null
            # (1 unchanged attribute hidden)
        }

      - rule {
          - api_groups        = [
              - null,
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "secrets",
              - "serviceaccounts",
            ] -> null
          - verbs             = [
              - "get",
              - "list",
              - "watch",
            ] -> null
        }
      - rule {
          - api_groups        = [
              - "rbac.authorization.k8s.io",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "roles",
              - "rolebindings",
              - "clusterroles",
              - "clusterrolebindings",
            ] -> null
          - verbs             = [
              - "get",
              - "list",
              - "watch",
            ] -> null
        }
    }

  # module.iam.kubernetes_cluster_role_binding.atlantis_rbac_binding will be destroyed
  # (because kubernetes_cluster_role_binding.atlantis_rbac_binding is not in configuration)
- resource "kubernetes_cluster_role_binding" "atlantis_rbac_binding" {
      - id = "atlantis-access-binding" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "atlantis-access-binding" -> null
          - resource_version = "48652" -> null
          - uid              = "f9a229c8-ce22-434a-aba5-299e081b89e6" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "atlantis-access" -> null
        }

      - subject {
          - kind      = "ServiceAccount" -> null
          - name      = "atlantis-new" -> null
          - namespace = "default" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.iam.kubernetes_role.aws_auth_manager will be destroyed
  # (because kubernetes_role.aws_auth_manager is not in configuration)
- resource "kubernetes_role" "aws_auth_manager" {
      - id = "kube-system/aws-auth-manager" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "aws-auth-manager" -> null
          - namespace        = "kube-system" -> null
          - resource_version = "41481" -> null
          - uid              = "fef8fc0d-a37a-4a26-b781-6c569a7cfcf2" -> null
            # (1 unchanged attribute hidden)
        }

      - rule {
          - api_groups     = [
              - null,
            ] -> null
          - resource_names = [
              - "aws-auth",
            ] -> null
          - resources      = [
              - "configmaps",
            ] -> null
          - verbs          = [
              - "get",
              - "patch",
              - "update",
            ] -> null
        }
    }

  # module.iam.kubernetes_role_binding.aws_auth_manager_binding will be destroyed
  # (because kubernetes_role_binding.aws_auth_manager_binding is not in configuration)
- resource "kubernetes_role_binding" "aws_auth_manager_binding" {
      - id = "kube-system/aws-auth-manager-binding" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "aws-auth-manager-binding" -> null
          - namespace        = "kube-system" -> null
          - resource_version = "41681" -> null
          - uid              = "7e1b5b1b-80e2-4dc7-8fe5-d91d8160635c" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Role" -> null
          - name      = "aws-auth-manager" -> null
        }

      - subject {
          - kind      = "ServiceAccount" -> null
          - name      = "atlantis-new" -> null
          - namespace = "default" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.iam.kubernetes_service_account.atlantis_sa will be destroyed
  # (because kubernetes_service_account.atlantis_sa is not in configuration)
- resource "kubernetes_service_account" "atlantis_sa" {
      - automount_service_account_token = true -> null
      - id                              = "default/atlantis-new" -> null
        # (1 unchanged attribute hidden)

      - metadata {
          - annotations      = {
              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::895976263444:role/atlantis-irsa-role"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "atlantis-new" -> null
          - namespace        = "default" -> null
          - resource_version = "49384" -> null
          - uid              = "258b4246-7bb6-4258-975d-26679c013ecf" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0"
      ~ tags            = {
          + "Environment" = "production"
          + "Name"        = "poc-eks-cluster-eks-irsa"
        }
      ~ tags_all        = {
          + "Environment" = "production"
          + "Name"        = "poc-eks-cluster-eks-irsa"
        }
      ~ thumbprint_list = [
          ~ "9e99a48a9960b14926bb7f3b02e22da0cbed5e11" -> "06b25927c42a721631c1efd9431e648fa62e1e39",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
~ resource "aws_kms_key" "this" {
        id                                 = "2bad14fa-6188-40bc-a39c-7ce04cff5c42"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::895976263444:user/shwetaec12" -> "arn:aws:iam::895976263444:role/atlantis-irsa-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::895976263444:role/poc-eks-cluster-cluster-20250615224556704300000003"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                  - {
                      - Action    = [
                          - "kms:DescribeKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:ListAliases",
                          - "kms:GetKeyPolicy",
                          - "kms:GetKeyRotationStatus",
                          - "kms:ListResourceTags",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::895976263444:role/atlantis-irsa-role"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowAtlantisIRSAKeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment" = "production"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 6 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.s3_backend.aws_s3_bucket.this,
│   on modules/s3-backend/main.tf line 1, in resource "aws_s3_bucket" "this":
│    1: resource "aws_s3_bucket" "this" {
│ 
│ server_side_encryption_configuration is deprecated. Use the
│ aws_s3_bucket_server_side_encryption_configuration resource instead.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://a6a50b2a1c777415fa9887f3c985f539-1548251577.eu-central-1.elb.amazonaws.com/lock?id=shwetaec12%252Feks-atlantis-poc%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 6 to change, 6 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```